/**
 * DTO для категории.
 * Используется для передачи данных между слоями приложения.
 */
export interface CategoryDto {
    /**
     * Идентификатор категории.
     */
    id: string;

    /**
     * Название категории.
     */
    name: string;

    /**
     * Идентификатор пользователя, которому принадлежит категория.
     */
    userId: string;

    /**
     * Дата создания категории.
     */
    createdAt: Date;

    /**
     * Дата последнего обновления категории.
     */
    updatedAt: Date | null;

    /**
     * Код общего доступа к категории.
     */
    shareCode: string | null;

    /**
     * Дата истечения срока действия кода общего доступа.
     */
    shareCodeExpiry: Date | null;

    /**
     * Идентификатор связанной категории.
     */
    linkedCategoryId: string | null;
} 