/**
 * DTO для элемента списка покупок.
 * Используется для передачи данных между слоями приложения.
 */
export interface ShoppingListItemDto {
    /**
     * Идентификатор элемента.
     */
    id: string;

    /**
     * Название элемента.
     */
    name: string;

    /**
     * Идентификатор пользователя, которому принадлежит элемент.
     */
    userId: string;

    /**
     * Идентификатор категории, к которой относится элемент.
     */
    categoryId: string;

    /**
     * Количество товара.
     */
    quantity: number;

    /**
     * Флаг, указывающий на то, что элемент куплен.
     */
    purchased: boolean;

    /**
     * Дата покупки элемента (если куплен).
     */
    purchasedDate: Date | null;

    /**
     * Дата создания элемента.
     */
    createdAt: Date;

    /**
     * Дата последнего обновления элемента.
     */
    updatedAt: Date | null;
} 