/**
 * DTO для пользователя.
 * Используется для передачи данных между слоями приложения.
 */
export interface UserDto {
    /**
     * Идентификатор пользователя.
     */
    id: string;

    /**
     * Имя пользователя.
     */
    name: string;

    /**
     * Флаг активности пользователя.
     */
    isActive: boolean;

    /**
     * Дата последней активности пользователя.
     */
    lastActivityAt: Date;

    /**
     * Дата создания пользователя.
     */
    createdAt: Date;

    /**
     * Дата последнего обновления пользователя.
     */
    updatedAt: Date | null;
}